package Grammar;

public class constant {
	public static void main(String[] args) {
		// 상수(constant)
		/* 상수란 변수와 마찬가지로 데이터를 저장할 수 있는 메모리 공간을 의미합니다
		 * 하지만 상수가 변수와 다른 점은 프로그램이 실행되는 동안 메모리에 저장된 데이터를 변경핤 수 없다는 것입니다*/
		
		
		/*상수(constant)*/
		/*상수는 변수와 마찬가지로 이름을 가지고 있는 메모리 공간으로 이러한 상수는 선언과 동시에 반드시 초기화해야 됩니다
		 * 자바에서는 final 키워드를 사용하여 선언합니다*/
		final int ages=17;
		// 위에 예제처럼 final 키워드를 사용한 상수는 선언과 함계 반드시 초기화해야 합니다
		// 자바에서 상수의 이름은 일반적으로 모두 대문자를 사용하여 선언합니다
		// 또한, 여러 단어로 이루어진 이름인 경우에는 인더스코어(_)를 사용하여 구분합니다
		
		
		/*리터럴(literal)*/
		/*리터럴이란 그 자체로 값을 의미하는 것입니다
		 *즉 변수와 상수와는 달리 데이터가 저장된 메모리 공간을 가리키는 이름을 가지고 있지 않습니다*/
		int var=30; //30이 바로 리터럴
		final int age1=100; // 100이 바로 리터럴
		
		
		
		}
}
